{
  "basics": {
    "name": "Oren Mittman",
    "label": "Software Engineer",
    "image": "http://0.gravatar.com/avatar/4523ee21ee63e334517eb3ac134121cc?size=400",
    "email": "oren.mittman@gmail.com",
    "phone": "(410) 802-5604",
    "url": "https://github.com/nihil2501",
    "summary": "I relish the depth and creativity of software engineering and take pride in my contributions to software projects. I have over a decade of experience designing and implementing robust server-sides that power e-commerce applications serving millions of users and tens of thousands of businesses. In the next phase of my career, I want to move down the stack and help engineer the distributed systems on top of which web applications are built. My greatest wish is to work in an environment where continual learning and collaboration foster the creation of great software."
  },
  "work": [
    {
      "name": "Leafly",
      "location": "Baltimore, MD",
      "description": "Cannabis marketplace",
      "position": "Senior Backend Engineer",
      "url": "https://www.leafly.com",
      "startDate": "2018-02-01",
      "endDate": "2022-10-01",
      "summary": "Collaborated within the product organization to design, implement, and maintain the backend systems powering Leafly's marketplace applications. Specialized on the platforms that enable retailers to integrate with their other marketplace software and, as a consequence, modeled Leafly's foundational business logic.",
      "highlights": [
        "Designed, implemented, and maintained a robust integration platform and associated API for synchronizing inventory data from several dozen business partners on behalf of tens of thousands of retailers",
        "Built the backend for an application that allows retailers with integrated inventories to associate their menus with a canonical product catalog",
        "Built the backend for an admin-facing order dashboard supporting complex features like order modifications, alerting, and other realtime behaviors",
        "Collaborated on the first versions of newer integration offerings on considerably accelerated timelines, including a shopper integration with Uber Eats and the prototype for a webhook-based ordering API",
        "Designed a unifying data model for Leafly's assortment of integration offerings such that they could be administered consistently from a single application",
        "Developed a technologically low-commitment micro-system for exactly-once execution of offline workloads undergirding multiple of the aforementioned backend services"
      ]
    },
    {
      "name": "OrderUp (acquired by Groupon)",
      "location": "Baltimore, MD",
      "description": "Online restaurant ordering and delivery",
      "position": "Software Engineer",
      "startDate": "2011-11-01",
      "endDate": "2018-01-01",
      "summary": "Worked fullstack across three generations of OrderUp's technology. The product grew to include an at-the-time cutting-edge feature, online delivery tracking, and was eventually acquired by Groupon.",
      "highlights": [
        "Worked fullstack across three generations of OrderUp's technology, participating in the migration efforts for each generation",
        "Developed the e-commerce integration systems that synchronized menus and orders with OrderUp's business partners",
        "Built admin systems for order management including an order dashboard and notification system"
      ]
    }
  ],
  "education": [
    {
      "institution": "Johns Hopkins University",
      "url": "https://www.jhu.edu",
      "area": "Mathematics",
      "studyType": "Bachelor of Arts",
      "startDate": "2004-09-01",
      "endDate": "2011-06-01"
    }
  ],
  "skills": {
    "languages": {
      "expert": [
        "Ruby"
      ],
      "intermediate": [],
      "novice": [
        "Typescript",
        "Python",
        "Elixir",
        "Rust"
      ]
    },
    "frameworks": {
      "expert": [
        "Ruby on Rails",
        "Sidekiq"
      ],
      "intermediate": [],
      "novice": [
        "Phoenix",
        "React"
      ]
    },
    "databases": {
      "expert": [
        "SQL"
      ],
      "intermediate": [],
      "novice": [
        "Redis",
        "Elasticsearch"
      ]
    },
    "infrastructure": {
      "expert": [],
      "intermediate": [],
      "novice": [
        "AWS",
        "Kubernetes",
        "Datadog"
      ]
    },
    "tools": [
      "TDD",
      "Git & GitHub",
      "Jira",
      "Confluence",
      "Agile"
    ]
  },
  "interests": [
    "Distributed Systems",
    "Programming Languages",
    "Functional Programming",
    "Category Theory"
  ]
}